Revit 2027 API
IFCTransaction.Commit Method
 Commits all changes made to the IFC file during the transaction.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Commit()
Public Sub Commit
public:
void Commit()
member Commit : unit -> unit
See Also
Reference
IFCTransaction Class
Autodesk.Revit.DB.IFC Namespace